#+TITLE: Generic AVL Tree in C#

** Traversal 

#+BEGIN_SRC csharp :tangle demo/testtraverse.cs 
public class TestTraverse {

  public static void Main() {
    var avltree = new AVLTree<int>(); 
    for(int i = 15; i > 0; i--)
      avltree.Insert(i); 

    foreach(var i in avltree.ToList())
      System.Console.WriteLine(i); 
    foreach(var i in avltree.ToList(avltree.Postorder()))
      System.Console.WriteLine(i); 
    foreach(var i in avltree.ToList(avltree.Inorder()))
      System.Console.WriteLine(i); 

  }
}
#+END_SRC

#+BEGIN_SRC sh :results verbatim :exports both 
mcs demo/testtraverse.cs src/avltreelistextensions.cs src/avltree.cs
mono demo/testtraverse.exe
#+END_SRC

#+RESULTS:
#+begin_example
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
15
14
13
12
11
10
9
8
7
6
5
4
3
2
1
#+end_example


** Sort Performance 

#+BEGIN_SRC csharp :tangle demo/treesort.cs 
using System; 
using System.Linq; 
using System.Collections.Generic; 
using System.Diagnostics; 

public class Treesort {

  public static void Main() {

    int n = 1000000;
    var random = new Random();
    Console.WriteLine("Generating {0} random elements...", n);
    var numbers = Enumerable.Range(0,n).Select(x => random.Next()); 

    var T = new AVLTree<int>();
    Console.WriteLine("Sorting {0} random elements...", n); 
    var sw = Stopwatch.StartNew(); 
    foreach(var i in numbers) 
      T.Insert(i); 
    var elapsedInsert = sw.ElapsedMilliseconds;
    T.ToList(); 
    var elapsedRemove = sw.ElapsedMilliseconds;
    sw.Stop(); 
    Console.WriteLine("Insertion: {0} ToList: {1} Combined: {2}", elapsedInsert, elapsedRemove, elapsedInsert + elapsedRemove); 
  }
}
#+END_SRC

#+BEGIN_SRC sh :results verbatim :exports both 
mcs demo/treesort.cs src/avltreelistextensions.cs src/avltree.cs
mono demo/treesort.exe
#+END_SRC

#+RESULTS:
: Generating 1000000 random elements...
: Sorting 1000000 random elements...
: Insertion: 1180 ToList: 1277 Combined: 2457


